In [37]:
import pandas as pd
import numpy as np
from datetime import datetime

In [19]:
df = pd.read_excel("test.xlsx")

In [20]:
df.rename(columns={'Unnamed: 1': 'Perticular', 'Unnamed: 2': 'Type','Unnamed: 3':'Ampunt','Transaction Statement for 8233101894':'Date'}, inplace=True)

In [21]:
df

                    Date     Transaction Details   Type Amount
0  Sep 15, 2024              Paid to Banti saini  DEBIT    ₹15
1  Sep 14, 2024              Paid to Banti saini  DEBIT    ₹20
2   Sep 13, 2024             Paid to Banti saini  DEBIT    ₹20
3  Sep 13, 2024                    Paid to MANAV  DEBIT   ₹500
4  Sep 13, 2024                    Paid to MANAV  DEBIT   ₹500
5  Sep 13, 2024              Paid to Vijay Singh  DEBIT    ₹40
6  Sep 13, 2024           Paid to Ramesh parlour  DEBIT    ₹60

In [22]:
df=df.drop(0)
df=df.drop(1)

In [23]:
df

                    Date     Transaction Details   Type Amount
2   Sep 13, 2024             Paid to Banti saini  DEBIT    ₹20
3  Sep 13, 2024                    Paid to MANAV  DEBIT   ₹500
4  Sep 13, 2024                    Paid to MANAV  DEBIT   ₹500
5  Sep 13, 2024              Paid to Vijay Singh  DEBIT    ₹40
6  Sep 13, 2024           Paid to Ramesh parlour  DEBIT    ₹60

In [24]:
df["Date"][2]

'Sep 13, 2024        '

In [25]:
df.isnull().sum()

Date                   0
Transaction Details    0
Type                   0
Amount                 0
dtype: int64

In [26]:
df =df.dropna(axis = 0)

In [27]:
df

                    Date     Transaction Details   Type Amount
2   Sep 13, 2024             Paid to Banti saini  DEBIT    ₹20
3  Sep 13, 2024                    Paid to MANAV  DEBIT   ₹500
4  Sep 13, 2024                    Paid to MANAV  DEBIT   ₹500
5  Sep 13, 2024              Paid to Vijay Singh  DEBIT    ₹40
6  Sep 13, 2024           Paid to Ramesh parlour  DEBIT    ₹60

## reste index

In [28]:


df.reset_index(inplace = True, drop = True)

In [12]:
df

                    Date     Transaction Details   Type Amount
0   Sep 13, 2024             Paid to Banti saini  DEBIT    ₹20
1  Sep 13, 2024                    Paid to MANAV  DEBIT   ₹500
2  Sep 13, 2024                    Paid to MANAV  DEBIT   ₹500
3  Sep 13, 2024              Paid to Vijay Singh  DEBIT    ₹40
4  Sep 13, 2024           Paid to Ramesh parlour  DEBIT    ₹60

In [32]:
##processing with Amount columns.

type(df['Amount'][2])

str

In [33]:
df['Amount'][2][1:]

'500'

In [35]:
df['Amount'] = df['Amount'].apply(lambda x: int(x[1:]))

## handle Date column

In [43]:
#type(df['Date'][0])

str

In [44]:
#df['Date'][0].strftime("%Y-%m-%d")

In [45]:
# df['Date']= df['Date'].apply(lambda x: x.strftime("%Y-%m-%d"))

In [46]:
df

                    Date     Transaction Details   Type  Amount
0   Sep 13, 2024             Paid to Banti saini  DEBIT      20
1  Sep 13, 2024                    Paid to MANAV  DEBIT     500
2  Sep 13, 2024                    Paid to MANAV  DEBIT     500
3  Sep 13, 2024              Paid to Vijay Singh  DEBIT      40
4  Sep 13, 2024           Paid to Ramesh parlour  DEBIT      60

## split data in credit or debit

In [47]:

df_out = df[df.Type =="DEBIT"]

In [48]:
df_out

                    Date     Transaction Details   Type  Amount
0   Sep 13, 2024             Paid to Banti saini  DEBIT      20
1  Sep 13, 2024                    Paid to MANAV  DEBIT     500
2  Sep 13, 2024                    Paid to MANAV  DEBIT     500
3  Sep 13, 2024              Paid to Vijay Singh  DEBIT      40
4  Sep 13, 2024           Paid to Ramesh parlour  DEBIT      60

In [49]:
df_in = df[df.Type =="CREDIT"]

In [50]:
df_in

Empty DataFrame
Columns: [Date, Transaction Details, Type, Amount]
Index: []

## Represintation for insights

In [1]:
import seaborn as sns
import matplotlib.pyplot as plt